cylinder_standard_way/1_cfd/cfd/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       159600;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       239600;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       240000;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       240200;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       320200;
    }
)

// ************************************************************************* //
